docs/lmc-class.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-07-18 Tue 12:20 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Linear Multivariable Controll</title>
<meta name="author" content="Alexander Brown" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="preamble" class="status">
<nav><a href="index.html">Home</a> | <a href="blog.html">Blog</a> | <a href="notes.html">Notes</a> | <a href="class.html">Classes</a> | <a href="projects.html">Projects</a> | <a href="todo.html">Todo</a> | <a href="error.html">About</a></nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Linear Multivariable Controll</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgd8ea8ee">1. Section1</a></li>
<li><a href="#org59c21cf">2. Section2</a></li>
<li><a href="#org5a01937">3. Section3</a></li>
<li><a href="#orgc5a70e4">4. Section4</a></li>
<li><a href="#org66db978">5. Section5</a></li>
</ul>
</div>
</nav>

<div id="outline-container-orgd8ea8ee" class="outline-2">
<h2 id="orgd8ea8ee"><span class="section-number-2">1.</span> Section1</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="lmc/Section1/basicmathreview.html">basicmathreview.html</a></li>
<li><a href="lmc/Section1/dynamicalsystemsl.html">dynamicalsystemsl.html</a></li>
<li><a href="lmc/Section1/formulatingsimplelinearsystems.html">formulatingsimplelinearsystems.html</a></li>
<li><a href="lmc/Section1/linearalgebrareview.html">linearalgebrareview.html</a></li>
<li><a href="lmc/Section1/linearizingnonlinearsystems.html">linearizingnonlinearsystems.html</a></li>
<li><a href="lmc/Section1/s01-l05realizationtheory.pdf">s01-l05realizationtheory.pdf</a></li>
<li><a href="lmc/Section1/s01-l06solutiontolinearsystems.pdf">s01-l06solutiontolinearsystems.pdf</a></li>
<li><a href="lmc/Section1/s01-l07discretizinglinearsystem.pdf">s01-l07discretizinglinearsystem.pdf</a></li>
<li><a href="lmc/Section1/s01-l08eigenvalues.pdf">s01-l08eigenvalues.pdf</a></li>
</ul>
</div>
</div>

<div id="outline-container-org59c21cf" class="outline-2">
<h2 id="org59c21cf"><span class="section-number-2">2.</span> Section2</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><a href="lmc/Section2/breifintrotofeedbackcontrolandcontrollabilitylive.pdf">breifintrotofeedbackcontrolandcontrollabilitylive.pdf</a></li>
<li><a href="lmc/Section2/s02-03stabilityvialyapunov.pdf">s02-03stabilityvialyapunov.pdf</a></li>
<li><a href="lmc/Section2/s02-l01stabilitypreliminariesltisystems.pdf">s02-l01stabilitypreliminariesltisystems.pdf</a></li>
<li><a href="lmc/Section2/s02-l02alookatstabilityforltvandnonlinear.pdf">s02-l02alookatstabilityforltvandnonlinear.pdf</a></li>
<li><a href="lmc/Section2/s02-l04briefintrotofeedbackcontrolandcontrollability.pdf">s02-l04briefintrotofeedbackcontrolandcontrollability.pdf</a></li>
</ul>
</div>
</div>

<div id="outline-container-org5a01937" class="outline-2">
<h2 id="org5a01937"><span class="section-number-2">3.</span> Section3</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><a href="lmc/Section3/S03_03ControlExamples.pdf">S03<sub>03ControlExamples.pdf</sub></a></li>
<li><a href="lmc/Section3/s03-01reachableandcontrollablesubspaces.pdf">s03-01reachableandcontrollablesubspaces.pdf</a></li>
<li><a href="lmc/Section3/s03-02completecontrollability.pdf">s03-02completecontrollability.pdf</a></li>
<li><a href="lmc/Section3/s03-03controllabledecomposition.html">s03-03controllabledecomposition.html</a></li>
<li><a href="lmc/Section3/s03-03controllabledecomposition.pdf">s03-03controllabledecomposition.pdf</a></li>
<li><a href="lmc/Section3/s03-04poleplacement.html">s03-04poleplacement.html</a></li>
<li><a href="lmc/Section3/s03-05controlexamples.pdf">s03-05controlexamples.pdf</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgc5a70e4" class="outline-2">
<h2 id="orgc5a70e4"><span class="section-number-2">4.</span> Section4</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li><a href="lmc/Section4/nov-12-7.37am.html">nov-12-7.37am.html</a></li>
<li><a href="lmc/Section4/s04-l01observability.pdf">s04-l01observability.pdf</a></li>
<li><a href="lmc/Section4/s04-l02minimality.pdf">s04-l02minimality.pdf</a></li>
<li><a href="lmc/Section4/s04-l03outputfeedback.html">s04-l03outputfeedback.html</a></li>
<li><a href="lmc/Section4/s04-l04lunenbuergerobservers.pdf">s04-l04lunenbuergerobservers.pdf</a></li>
</ul>
</div>
</div>

<div id="outline-container-org66db978" class="outline-2">
<h2 id="org66db978"><span class="section-number-2">5.</span> Section5</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li><a href="lmc/Section5/dec-01-1.35pm.html">dec-01-1.35pm.html</a></li>
<li><a href="lmc/Section5/s05-l01introtolqrdesign.html">s05-l01introtolqrdesign.html</a></li>
<li><a href="lmc/Section5/s05-l02numericalmethodstoricattiequation.pdf">s05-l02numericalmethodstoricattiequation.pdf</a></li>
<li><a href="lmc/Section5/s05-l03infinitehorizoncontrol.pdf">s05-l03infinitehorizoncontrol.pdf</a></li>
<li><a href="lmc/Section5/s05-l04statespaceintegraldesign.pdf">s05-l04statespaceintegraldesign.pdf</a></li>
<li><a href="lmc/Section5/s05-l06infinitehorizonpointexamples.html">s05-l06infinitehorizonpointexamples.html</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Alexander Brown</p>
<p class="date">Created: 2023-07-18 Tue 12:20</p>
</div>
</body>
</html>
